library/app/controllers/books_controller.rb

SELECT * FROM "books"
---
  def index
    @page_title = "Books >> Index"
    @books = Book.all

SELECT * FROM "authors" INNER JOIN "authors_books" ON "authors".id = "authors_books".author_id WHERE ("authors_books".book_id = 1 )
---
  def show
    @authors = Author.all - @book.authors

INSERT INTO "books" ("isbn", "updated_at", "title", "created_at") VALUES('87658765', '2009-04-07 10:50:18', 'Title', '2009-04-07 10:50:18')
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      format.js do
        @book.save

UPDATE "books" SET "title" = 'Pragmatic Programmer', "updated_at" = '2009-04-07 12:09:37' WHERE "id" = 3
---
  def update
    if @book.update_attributes(
                params[:book])